benchmarks/compute-sanitizer/exp0008-20260810T191607Z/sampled_memory_barrier/warmup-client.log
W0810 19:45:26.460000 1 torch/utils/cpp_extension.py:140] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
INFO 08-10 19:45:26 [main.py:66] Unspecified platform detected, switching to CPU Platform instead.
INFO 08-10 19:45:26 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-10 19:45:26 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 08-10 19:45:26 [cpu.py:428] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 08-10 19:45:27 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 08-10 19:45:27 [nixl_utils.py:34] NIXL is not available
WARNING 08-10 19:45:27 [nixl_utils.py:44] NIXL agent config is not available
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xff360478dd00>, trust_remote_code=False, seed=20260809, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=16, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label='warmup', backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='Qwen/Qwen3-14B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/results', result_filename='warmup.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='sampled_memory_barrier-warmup-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-10 19:45:29 [utils.py:90] Sampling input_len from [128, 128] and output_len from [16, 16]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 8/8 [00:02<00:00,  2.88it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  2.78      
Total input tokens:                      1024      
Total generated tokens:                  128       
Request throughput (req/s):              2.88      
Output token throughput (tok/s):         46.12     
Peak output token throughput (tok/s):    64.00     
Peak concurrent requests:                8.00      
Total token throughput (tok/s):          415.12    
---------------Time to First Token----------------
Mean TTFT (ms):                          724.90    
Median TTFT (ms):                        786.07    
P50 TTFT (ms):                           786.07    
P95 TTFT (ms):                           787.09    
P99 TTFT (ms):                           787.16    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          135.58    
Median TPOT (ms):                        132.51    
P50 TPOT (ms):                           132.51    
P95 TPOT (ms):                           148.50    
P99 TPOT (ms):                           155.39    
---------------Inter-token Latency----------------
Mean ITL (ms):                           135.58    
Median ITL (ms):                         125.61    
P50 ITL (ms):                            125.61    
P95 ITL (ms):                            230.93    
P99 ITL (ms):                            231.04    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2758.67   
Median E2EL (ms):                        2773.74   
P50 E2EL (ms):                           2773.74   
P95 E2EL (ms):                           2774.74   
P99 E2EL (ms):                           2774.81   
==================================================